tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1455_tdd.h
#define UPUEN                         522
#define UTEYE                         523
#define UIE                           524
#define URSTIE                        525
#define UERRIE                        526
#define ACTVIE                        527
#define TRNIE                         528
#define IDLEIE                        529
#define STALLIE                       530
#define SOFIE                         531
#define UEIR                          532
#define PIDEF                         533
#define CRC5EF                        534
#define CRC16EF                       535
#define DFN8EF                        536
#define BTOEF                         537
#define BTSEF                         538
#define UFRMH                         539
#define FRM8                          540
#define FRM9                          541
#define FRM10                         542
#define UFRML                         543
#define FRM0                          544
#define FRM1                          545
#define FRM2                          546
#define FRM3                          547
#define FRM4                          548
#define FRM5                          549
#define FRM6                          550
#define FRM7                          551
#define UADDR                         552
#define ADDR0                         553
#define ADDR1                         554
#define ADDR2                         555
#define ADDR3                         556
#define ADDR4                         557
#define ADDR5                         558
#define ADDR6                         559
#define UEIE                          560
#define PIDEE                         561
#define CRC5EE                        562
#define CRC16EE                       563
#define DFN8EE                        564
#define BTOEE                         565
#define BTSEE                         566
#define UEP0                          567
#define UEP0_EPSTALL                  568
#define UEP0_EPINEN                   569
#define UEP0_EPOUTEN                  570
#define UEP0_EPCONDIS                 571
#define UEP0_EPHSHK                   572
#define UEP1                          573
#define UEP1_EPSTALL                  574
#define UEP1_EPINEN                   575
#define UEP1_EPOUTEN                  576
#define UEP1_EPCONDIS                 577
#define UEP1_EPHSHK                   578
#define UEP2                          579
#define UEP2_EPSTALL                  580
#define UEP2_EPINEN                   581
#define UEP2_EPOUTEN                  582
#define UEP2_EPCONDIS                 583
#define UEP2_EPHSHK                   584
#define UEP3                          585
#define UEP3_EPSTALL                  586
#define UEP3_EPINEN                   587
#define UEP3_EPOUTEN                  588
#define UEP3_EPCONDIS                 589
#define UEP3_EPHSHK                   590
#define UEP4                          591
#define UEP4_EPSTALL                  592
#define UEP4_EPINEN                   593
#define UEP4_EPOUTEN                  594
#define UEP4_EPCONDIS                 595
#define UEP4_EPHSHK                   596
#define UEP5                          597
#define UEP5_EPSTALL                  598
#define UEP5_EPINEN                   599
#define UEP5_EPOUTEN                  600
#define UEP5_EPCONDIS                 601
#define UEP5_EPHSHK                   602
#define UEP6                          603
#define UEP6_EPSTALL                  604
#define UEP6_EPINEN                   605
#define UEP6_EPOUTEN                  606
#define UEP6_EPCONDIS                 607
#define UEP6_EPHSHK                   608
#define UEP7                          609
#define UEP7_EPSTALL                  610
#define UEP7_EPINEN                   611
#define UEP7_EPOUTEN                  612
#define UEP7_EPCONDIS                 613
#define UEP7_EPHSHK                   614
#define STATUS_SHAD                   615
#define STATUS_SHAD_C                 616
#define STATUS_SHAD_DC                617
#define STATUS_SHAD_Z                 618
#define WREG_SHAD                     619
#define BSR_SHAD                      620
#define PCLATH_SHAD                   621
#define FSR0L_SHAD                    622
#define FSR0H_SHAD                    623
#define FSR1L_SHAD                    624
#define FSR1H_SHAD                    625
#define STKPTR                        626
#define TOSL                          627
#define TOSH                          628

#endif // _PIC16LF1455_H_
